import React, { Component } from 'react'
import Unit from '../Unit'

const unitsCfg = [
  [1, '車', 0, 0], [1, '車', 0, 8],
  [1, '马', 0, 1], [1, '马', 0, 7],
  [1, '相', 0, 2], [1, '相', 0, 6],
  [1, '仕', 0, 3], [1, '仕', 0, 5],
  [1, '帅', 0, 4],
  [1, '砲', 2, 1], [1, '砲', 2, 7],
  [1, '兵', 3, 0], [1, '兵', 3, 2], [1, '兵', 3, 4], [1, '兵', 3, 6], [1, '兵', 3, 8],

  [-1, '車', 9, 0], [-1, '車', 9, 8],
  [-1, '马', 9, 1], [-1, '马', 9, 7],
  [-1, '象', 9, 2], [-1, '象', 9, 6],
  [-1, '士', 9, 3], [-1, '士', 9, 5],
  [-1, '将', 9, 4],
  [-1, '炮', 7, 1], [-1, '炮', 7, 7],
  [-1, '卒', 6, 0], [-1, '卒', 6, 2], [-1, '卒', 6, 4], [-1, '卒', 6, 6], [-1, '卒', 6, 8]
]

export default class UnitSet extends Component {

  render() {
    return (
      <div className="chs">
        {
          unitsCfg.map((item, i) => (
            <Unit key={`unit_${i}`} i={i} data={item} />
          ))
        }
      </div>
    )
  }
}
